# 虚幻5学习记录

## [B站的新手0基础教程](https://www.bilibili.com/video/BV1Cd4y1V7G5/?spm_id_from=333.788.recommend_more_video.0&vd_source=d11acc752470369f5a31a7384588240d)

2023年4月23日开始学习，主要内容是教基础操作和搭建了一个山洞场景。

### 2023年4月23日

#### s01-虚幻引警安装及创建工程说明讲解

虚幻5.1主要更新内容：Lumen光照、Nanite模型

> 删除UE4/5在C盘的缓存
>
> 然后请显示隐藏文件功能打开
>
> 接着去删除缓存:
>
> C\Users\你的用户名\AppData\Local\UnrealEngine\Common\DerivedDataCache
>
> 接着使用记事本打开:引擎版本\Engine\Config\BaseEngine.ini
>
> Ctrl+F查找
>
> ENGINEVERSIONAGNOSTICUSERDIR%DerivedDataCache
>
> 替换为
>
> GAMEDIR%DerivedDataCache



#### s02-用户操作界面介绍及操作

世界场景设置（World Settings）建议加载到界面中，是常用功能。

调整摄像机速度：

1. 右上角摄像机图片，可以调整。
2. 2.鼠标按住右键+QWEASD等+滑轮

空间坐标（单位为厘米）：

* 红轴X正方向为前方
* 绿轴Y正方向为右方
* 蓝轴Z正方向为上方

内容浏览器（Content Browser）：虚幻编辑器的主要区域，用于在虚幻项目中创建、导入、整理、查看和修改内容资产。你还可以用它管理内容文件夹，并执行专有资产操作。（Ctrl+空格）

* 内容浏览器中的保存左右：不仅仅是保存当前关卡，包括修改的材质球及模型等，同时进行保存，建议多点。

#### s03-创建和移动物体

放置物体的方式：

1. 在模块模式下可以通过获取界面进行选择。
2. 内容浏览器中点击过滤器，可以快速检索想要创建的物体。

快速将物体放于地面：End键

选择（Q）位移（W）旋转（E）缩放（R）

世界场景和本地（对象）空间：

* 世界空间是世界坐标系
* 局部的对象空间是对象原本的朝向

大纲中对所选的Actor按F (focus)：快速聚焦到所选的Actor

按住Shift拖动物体，可以保持物体在固定的屏幕位置，是个小技巧。

模型复制的方法：

1. Alt键+拖拽模型
2. Ctrl+D (位置上会有偏移)

模型加选减选：

1. Ctrl+点击进行加选/减选
2. 加选完成后按Alt键可以对模型进行批量复制

轴向移动小技巧：

同时选中两个模型时，可以按住鼠标中键，（位移模式）将原本物体的坐标轴拖动，可以临时改变轴中心的位置。

快速替换模型：

细节-所有-静态网格体

#### s04-1导入模型资产

确保模型的坐标轴归于原点(0,0,0)且在物体的底部，以便操作。

并非都最适合在底部，如墙面等适合在角点。

吸附：按住V键，会针对当前模型的角点进行吸附。

常用导出格式：FBX，最好使用2020格式。

轴向改成z轴（高度轴）

maya中估计的操作还是得再看视频。





#### s04-2 导入贴图资产

贴图（Texture）常用格式：png、tga

资源：[Poly Haven](https://polyhaven.com)

导入素材后记得及时点击保存所有

普通的贴图：sRGB记得勾上；黑白的：sRGB记得去掉

sRGB勾上是显示颜色给人看的，去掉是给电脑识别黑白数据的。

法线贴图，俗称“凹凸贴图”，是在某些情况(一般在minecraft里是使用特殊光影)给人一种错觉，一种3D的幻觉，让方块出现层次感，更加真实。

UE中使用统一的格式存储资源(uasset, umap)，每个uasset对应一个包(package)，存储一个UPackage对象时，会将该包下的所有对象都存到uasset中。

#### s04-3 导入资产包

content目录：内容文件夹属于工程的基本文件夹，大部分资产都是存放在内容文件夹目录下的，要注意在我们内容文件夹下不能同时出现两个名为内容的文件夹，否则在读取文件时可能会出现错误。

一、商场中获取资源并添加入工程

商场搜索Megascan（超级逼真扫描），下载添加到工程就完事了。

二、导入其他工程的Content文件

方式1.直接复制粘贴Content到现有工程

方式2.反正就是放到现有的Content中，注意别嵌套文件夹太多层。如果导入进来模型没有贴图，可能就是路径出错。

方式3.迁移其他工程资产。右键-资产操作-迁移-放置到Content目录下。注意不要再新建文件夹，直接放置到Content目录下，否则会GG。也可以文件夹直接点右键-迁移，同样是直接放置到Content目录下。

路径丢失：修复重定向器。

#### s04-4 导入bridge资产包

Bridge是Quixel Megascans的本地管理器，利用它可以从Quixel Megascans下载从城市到自然环境的写实材质和3D扫描模型。记得登录一下并且改一下存储路径。

Open/Close：这个模型是否全封闭。

下载时的质量选项：

> Low Quality >低质量
>
> Medium Quality >中等质量
>
> High Quality >高质量
>
> Nanite: Nanite（纳米级）是一套GPU-Driven的sub-pixel尺寸面片高模场景的纳米级品质实时渲染方案。

推荐：影视效果选纳米，一般选中等。









#### s05-材质基础认知

#### s06-光照系统介绍

